IRP/src/Catalogs/TaxExemptionReasons/TaxExemptionReasons.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>TaxExemptionReasons</name>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxRate</name>
  <type>
   <types>CatalogRef.TaxRates</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/TaxRates/TaxRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TaxRates</name>
  <attributes>
    <name>Rate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>12</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NoRate</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Countries/Countries.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Countries</name>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>LocalizationCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>2</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>AlphaCode3</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>3</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>AlphaCode2</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>2</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CIOCCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>10</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PhonePrefix</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>10</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Flag</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/TaxExemptionReasons/Forms/ChoiceForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	Parameters.Filter.Property("TaxRate", TaxRate);
	Items.TaxRateFilter.Enabled = Not ValueIsFilled(TaxRate);
	
	Parameters.Filter.Property("Country", Country);
	Items.CountryFilter.Enabled = Not ValueIsFilled(Country);
	
	Parameters.Filter.Clear();
	
	SetFilters();	

EndProcedure

&AtServer
Procedure SetFilters()
	
	QuerySchemaAPI = DynamicListAPI.Get(List);
	
	DynamicListAPI.ClearFilter(QuerySchemaAPI);
	If ValueIsFilled(TaxRate) Then
		DynamicListAPI.AddFilter(QuerySchemaAPI, 
			"TaxRate = &TaxRateFilter OR TaxRate = Value(Catalog.TaxRates.EmptyRef)");
	EndIf;
	If ValueIsFilled(Country) Then
		DynamicListAPI.AddFilter(QuerySchemaAPI, 
			"Country = &CountryFilter OR Country = Value(Catalog.Countries.EmptyRef)");
	EndIf;
	
	DynamicListAPI.Set(QuerySchemaAPI);
	
	If ValueIsFilled(TaxRate) Then
		List.Parameters.SetParameterValue("TaxRateFilter", TaxRate); 
	EndIf;
	If ValueIsFilled(Country) Then
		List.Parameters.SetParameterValue("CountryFilter", Country); 
	EndIf;
	
EndProcedure

&AtClient
Procedure CountryFilterOnChange(Item)
	SetFilters();
EndProcedure

&AtClient
Procedure TaxRateFilterOnChange(Item)
	SetFilters();
EndProcedure
